# Springboard Data Science Career Track Unit 4 Challenge - Tier 3 Complete

## Objectives
Hey! Great job getting through those challenging DataCamp courses. You're learning a lot in a short span of time. 

In this notebook, you're going to apply the skills you've been learning, bridging the gap between the controlled environment of DataCamp and the *slightly* messier work that data scientists do with actual datasets!

Here’s the mystery we’re going to solve: ***which boroughs of London have seen the greatest increase in housing prices, on average, over the last two decades?***


A borough is just a fancy word for district. You may be familiar with the five boroughs of New York… well, there are 32 boroughs within Greater London [(here's some info for the curious)](https://en.wikipedia.org/wiki/London_boroughs). Some of them are more desirable areas to live in, and the data will reflect that with a greater rise in housing prices.

***This is the Tier 3 notebook, which means it's not filled in at all: we'll just give you the skeleton of a project, the brief and the data. It's up to you to play around with it and see what you can find out! Good luck! If you struggle, feel free to look at easier tiers for help; but try to dip in and out of them, as the more independent work you do, the better it is for your learning!***

This challenge will make use of only what you learned in the following DataCamp courses: 
- Prework courses (Introduction to Python for Data Science, Intermediate Python for Data Science)
- Data Types for Data Science
- Python Data Science Toolbox (Part One) 
- pandas Foundations
- Manipulating DataFrames with pandas
- Merging DataFrames with pandas

Of the tools, techniques and concepts in the above DataCamp courses, this challenge should require the application of the following: 
- **pandas**
    - **data ingestion and inspection** (pandas Foundations, Module One) 
    - **exploratory data analysis** (pandas Foundations, Module Two)
    - **tidying and cleaning** (Manipulating DataFrames with pandas, Module Three) 
    - **transforming DataFrames** (Manipulating DataFrames with pandas, Module One)
    - **subsetting DataFrames with lists** (Manipulating DataFrames with pandas, Module One) 
    - **filtering DataFrames** (Manipulating DataFrames with pandas, Module One) 
    - **grouping data** (Manipulating DataFrames with pandas, Module Four) 
    - **melting data** (Manipulating DataFrames with pandas, Module Three) 
    - **advanced indexing** (Manipulating DataFrames with pandas, Module Four) 
- **matplotlib** (Intermediate Python for Data Science, Module One)
- **fundamental data types** (Data Types for Data Science, Module One) 
- **dictionaries** (Intermediate Python for Data Science, Module Two)
- **handling dates and times** (Data Types for Data Science, Module Four)
- **function definition** (Python Data Science Toolbox - Part One, Module One)
- **default arguments, variable length, and scope** (Python Data Science Toolbox - Part One, Module Two) 
- **lambda functions and error handling** (Python Data Science Toolbox - Part One, Module Four)

## The Data Science Pipeline

This is Tier Three, so we'll get you started. But after that, it's all in your hands! When you feel done with your investigations, look back over what you've accomplished, and prepare a quick presentation of your findings for the next mentor meeting. 

Data Science is magical. In this case study, you'll get to apply some complex machine learning algorithms. But as  [David Spiegelhalter](https://www.youtube.com/watch?v=oUs1uvsz0Ok) reminds us, there is no substitute for simply **taking a really, really good look at the data.** Sometimes, this is all we need to answer our question.

Data Science projects generally adhere to the four stages of Data Science Pipeline:
1. Sourcing and loading 
2. Cleaning, transforming, and visualizing 
3. Modeling 
4. Evaluating and concluding

### 1. Sourcing and Loading 

Any Data Science project kicks off by importing  ***pandas***. The documentation of this wonderful library can be found [here](https://pandas.pydata.org/). As you've seen, pandas is conveniently connected to the [Numpy](http://www.numpy.org/) and [Matplotlib](https://matplotlib.org/) libraries. 

***Hint:*** This part of the data science pipeline will test those skills you acquired in the pandas Foundations course, Module One.

#### 1.1. Importing Libraries

In [1]:
# Let's import the pandas, numpy libraries as pd, and np respectively. 
import pandas as pd
import numpy as np

# Load the pyplot collection of functions from matplotlib, as plt 
import matplotlib.pyplot as plt

#### 1.2.  Loading the data
Your data comes from the [London Datastore](https://data.london.gov.uk/): a free, open-source data-sharing portal for London-oriented datasets.

In [2]:
# First, make a variable called url_LondonHousePrices, and assign it the following link, enclosed in quotation-marks as a string:
# https://data.london.gov.uk/download/uk-house-price-index/70ac0766-8902-4eb5-aab5-01951aaed773/UK%20House%20price%20index.xls

url_LondonHousePrices = "https://data.london.gov.uk/download/uk-house-price-index/70ac0766-8902-4eb5-aab5-01951aaed773/UK%20House%20price%20index.xls"

# The dataset we're interested in contains the Average prices of the houses, and is actually on a particular sheet of the Excel file. 
# As a result, we need to specify the sheet name in the read_excel() method.
# Put this data into a variable called properties.  
properties = pd.read_excel(url_LondonHousePrices, sheet_name='Average price')

### 2. Cleaning, transforming, and visualizing
This second stage is arguably the most important part of any Data Science project. The first thing to do is take a proper look at the data. Cleaning forms the majority of this stage, and can be done both before or after Transformation.

The end goal of data cleaning is to have tidy data. When data is tidy: 

1. Each variable has a column.
2. Each observation forms a row.

Keep the end goal in mind as you move through this process, every step will take you closer. 



***Hint:*** This part of the data science pipeline should test those skills you acquired in: 
- Intermediate Python for data science, all modules.
- pandas Foundations, all modules. 
- Manipulating DataFrames with pandas, all modules.
- Data Types for Data Science, Module Four.
- Python Data Science Toolbox - Part One, all modules

**2.1. Exploring your data** 

Think about your pandas functions for checking out a dataframe.

In [3]:
properties.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 306 entries, 0 to 305
Data columns (total 49 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Unnamed: 0            305 non-null    datetime64[ns]
 1   City of London        306 non-null    object
 2   Barking & Dagenham    306 non-null    object
 3   Barnet                306 non-null    object
 4   Bexley                306 non-null    object
 5   Brent                 306 non-null    object
 6   Bromley               306 non-null    object
 7   Camden                306 non-null    object
 8   Croydon               306 non-null    object
 9   Ealing                306 non-null    object
 10  Enfield               306 non-null    object
 11  Greenwich             306 non-null    object
 12  Hackney               306 non-null    object
 13  Hammersmith & Fulham  306 non-null    object
 14  Haringey              306 non-null    object
 15  Harrow                306 non-null    object
 16  Havering              306 non-null    object
 17  Hillingdon            306 non-null    object
 18  Hounslow              306 non-null    object
 19  Islington             306 non-null    object
 20  Kensington & Chelsea  306 non-null    object
 21  Kingston upon Thames  306 non-null    object
 22  Lambeth               306 non-null    object
 23  Lewisham              306 non-null    object
 24  Merton                306 non-null    object
 25  Newham                306 non-null    object
 26  Redbridge             306 non-null    object
 27  Richmond upon Thames  306 non-null    object
 28  Southwark             306 non-null    object
 29  Sutton                306 non-null    object
 30  Tower Hamlets         306 non-null    object
 31  Waltham Forest        306 non-null    object
 32  Wandsworth            306 non-null    object
 33  Westminster           306 non-null    object
 34  Unnamed: 34           0 non-null      float64
 35  Inner London          306 non-null    object
 36  Outer London          306 non-null    object
 37  Unnamed: 37           0 non-null      float64
 38  NORTH EAST            306 non-null    object
 39  NORTH WEST            306 non-null    object
 40  YORKS & THE HUMBER    306 non-null    object
 41  EAST MIDLANDS         306 non-null    object
 42  WEST MIDLANDS         306 non-null    object
 43  EAST OF ENGLAND       306 non-null    object
 44  LONDON                306 non-null    object
 45  SOUTH EAST            306 non-null    object
 46  SOUTH WEST            306 non-null    object
 47  Unnamed: 47           0 non-null      float64
 48  England               306 non-null    object
dtypes: datetime64[ns](1), float64(3), object(45)
memory usage: 117.3+ KB

**2.2. Cleaning the data**

You might find you need to transpose your dataframe, check out what its row indexes are, and reset the index. You  also might find you need to assign the values of the first row to your column headings  . (Hint: recall the .columns feature of DataFrames, as well as the iloc[] method).

Don't be afraid to use StackOverflow for help  with this.

In [4]:
properties.head()

,Unnamed: 0,City of London,Barking & Dagenham,Barnet,Bexley,Brent,Bromley,Camden,Croydon,Ealing,...,NORTH WEST,YORKS & THE HUMBER,EAST MIDLANDS,WEST MIDLANDS,EAST OF ENGLAND,LONDON,SOUTH EAST,SOUTH WEST,Unnamed: 47,England
0,NaT,E09000001,E09000002,E09000003,E09000004,E09000005,E09000006,E09000007,E09000008,E09000009,...,E12000002,E12000003,E12000004,E12000005,E12000006,E12000007,E12000008,E12000009,NaN,E92000001
1,1995-01-01,91449,50460.2,93284.5,64958.1,71306.6,81671.5,120933,69158.2,79885.9,...,43958.5,44803.4,45544.5,48527.5,56701.6,74435.8,64018.9,54705.2,NaN,53202.8
2,1995-02-01,82202.8,51085.8,93190.2,64787.9,72022.3,81657.6,119509,68951.1,80897.1,...,43925.4,44528.8,46051.6,49341.3,56593.6,72777.9,63715,54356.1,NaN,53096.2
3,1995-03-01,79120.7,51269,92247.5,64367.5,72015.8,81449.3,120282,68712.4,81379.9,...,44434.9,45200.5,45383.8,49442.2,56171.2,73896.8,64113.6,53583.1,NaN,53201.3
4,1995-04-01,77101.2,53133.5,90762.9,64277.7,72965.6,81124.4,120098,68610,82188.9,...,44267.8,45614.3,46124.2,49455.9,56567.9,74455.3,64623.2,54786,NaN,53590.9

In [5]:
#Drop the first row
properties = properties.iloc[1:]

In [6]:
#Drop all null columns
properties.dropna(axis=1, inplace=True, how='all')

**2.3. Cleaning the data (part 2)**

You might we have to **rename** a couple columns. How do you do this? The clue's pretty bold...

In [7]:
#rename the first column to 'Date'
properties = properties.rename(columns={'Unnamed: 0':'Date'})

In [8]:
#set index of the data frame based on Date column
properties = properties.set_index('Date')

In [9]:
#change the type of data from 'Object' to 'float'
properties.loc[:, :] = properties.loc[:, :].astype('float')

In [10]:
#separate London Boroughs and other columns to two dataframes
london_boroughs = ['City of Westminster', 'Kensington & Chelsea', 'Hammersmith & Fulham', 'Wandsworth', 'Lambeth'
                    ,'Southwark', 'Tower Hamlets', 'Hackney', 'Islington', 'Camden', 'Brent', 'Ealing', 'Hounslow'
                    ,'Richmond upon Thames', 'Kingston upon Thames', 'Merton', 'Sutton', 'Croydon', 'Bromley'
                    ,'Lewisham', 'Greenwich', 'Bexley', 'Havering', 'Barking & Dagenham', 'Redbridge', 'Newham'
                    ,'Waltham Forest', 'Haringey', 'Enfield', 'Barnet', 'Harrow', 'Hillingdon']
        
left_boroughs = []

for items in london_boroughs:
    if items not in properties.columns:
        left_boroughs.append(items)

left_borough_dict = {}
for items in left_boroughs:
    for col in properties.columns:
        if col in items or items in col:
            left_borough_dict[col] = items

properties = properties.rename(columns=left_borough_dict)

left_boroughs = []

for items in london_boroughs:
    if items not in properties.columns:
        left_boroughs.append(items)
        
properties = properties[london_boroughs].copy()

**2.4.Transforming the data**

Remember what Wes McKinney said about tidy data? 

You might need to **melt** your DataFrame here.

In [11]:
#melt the properties dataframe 
properties_melted = pd.melt(properties.reset_index(), id_vars='Date', value_vars=properties.columns, var_name='Borough', value_name='Price')

In [12]:
#Break the Date column to Date_Year and Date_Month
properties_melted['Date_Year'] = pd.DatetimeIndex(properties_melted['Date']).year
properties_melted['Date_Month'] = pd.DatetimeIndex(properties_melted['Date']).month

In [13]:
properties_melted = properties_melted.set_index('Date')

Remember to make sure your column data types are all correct. Average prices, for example, should be floating point numbers...

In [14]:
properties_melted.info()
properties_melted.head()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 9760 entries, 1995-01-01 to 2020-05-01
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Borough     9760 non-null   object
 1   Price       9760 non-null   float64
 2   Date_Year   9760 non-null   int64
 3   Date_Month  9760 non-null   int64
dtypes: float64(1), int64(2), object(1)
memory usage: 381.2+ KB

                        Borough        Price  Date_Year  Date_Month
Date
1995-01-01  City of Westminster  133025.2772       1995           1
1995-02-01  City of Westminster  131468.3096       1995           2
1995-03-01  City of Westminster  132260.3417       1995           3
1995-04-01  City of Westminster  133370.2036       1995           4
1995-05-01  City of Westminster  133911.1117       1995           5

**2.5. Cleaning the data (part 3)**

Do we have an equal number of observations in the ID, Average Price, Month, and London Borough columns? Remember that there are only 32 London Boroughs. How many entries do you have in that column? 

Check out the contents of the London Borough column, and if you find null values, get rid of them however you see fit.

<font color=red, size=5> This is nonsense to me so I save this in melt branch in my git and will finish the case study without melt on the master branch </font>

In [15]:
properties_melted_mean = properties_melted.groupby(['Date', 'Date_Year', 'Date_Month', 'Borough']).mean()

In [17]:
properties_melted_mean

                                                           Price
Date       Date_Year Date_Month Borough
1995-01-01 1995      1          Barking & Dagenham   50460.22660
                                Barnet               93284.51832
                                Bexley               64958.09036
                                Brent                71306.56698
                                Bromley              81671.47692
...                                                          ...
2020-05-01 2020      5          Southwark           525472.69260
                                Sutton              376154.73580
                                Tower Hamlets       498227.83990
                                Waltham Forest      443509.79640
                                Wandsworth          615207.17390

[9760 rows x 1 columns]

**2.6. Visualizing the data**

To visualize the data, why not subset on a particular London Borough? Maybe do a line plot of Month against Average Price?

To limit the number of data points you have, you might want to extract the year from every month value your *Month* column. 

To this end, you *could* apply a ***lambda function***. Your logic could work as follows:
1. look through the `Month` column
2. extract the year from each individual value in that column 
3. store that corresponding year as separate column. 

Whether you go ahead with this is up to you. Just so long as you answer our initial brief: which boroughs of London have seen the greatest house price increase, on average, over the past two decades?

**3. Modeling**

Consider creating a function that will calculate a ratio of house prices, comparing the price of a house in 2018 to the price in 1998.

Consider calling this function create_price_ratio.

You'd want this function to:
1. Take a filter of dfg, specifically where this filter constrains the London_Borough, as an argument. For example, one admissible argument should be: dfg[dfg['London_Borough']=='Camden'].
2. Get the Average Price for that Borough, for the years 1998 and 2018.
4. Calculate the ratio of the Average Price for 1998 divided by the Average Price for 2018.
5. Return that ratio.

Once you've written this function, you ultimately want to use it to iterate through all the unique London_Boroughs and work out the ratio capturing the difference of house prices between 1998 and 2018.

Bear in mind: you don't have to write a function like this if you don't want to. If you can solve the brief otherwise, then great! 

***Hint***: This section should test the skills you acquired in:
- Python Data Science Toolbox - Part One, all modules

In [ ]:
def create_price_ratio(df, year_tup):
    #iterate through df, and for thoes items in london_borough, calculate the ratio:
    #1. Get the Average Price for that Borough, for the years 1998 and 2018
    #2. Calculate the ratio of the Average Price for 1998 divided by the Average Price for 2018
    #then return the ratio
    
    df = df.loc[: ,:].astype(float)
    
    london_boroughs = ['City of Westminster', 'Kensington & Chelsea', 'Hammersmith & Fulham', 'Wandsworth', 'Lambeth'
                    ,'Southwark', 'Tower Hamlets', 'Hackney', 'Islington', 'Camden', 'Brent', 'Ealing', 'Hounslow'
                    ,'Richmond upon Thames', 'Kingston upon Thames', 'Merton', 'Sutton', 'Croydon', 'Bromley'
                    ,'Lewisham', 'Greenwich', 'Bexley', 'Havering', 'Barking & Dagenham', 'Redbridge', 'Newham'
                    ,'Waltham Forest', 'Haringey', 'Enfield', 'Barnet', 'Harrow', 'Hillingdon']
    
    for tup in year_tup:
        if tup not in range(1995, 2026):
            return ('{} is out of range!'.format(tup))
        else:
            for col in df.columns:
                if col in london_boroughs:
                    df_yearly_mean = df.resample('A').mean()                
    
    #return borough_lst

ratio_lst = create_price_ratio(properties, (1998, 2018))
#print(ratio_lst)

In [ ]:
year_tup = (1998, 2018)
for tup in year_tup:
    print (tup in range(1998, 2026))

### 4. Conclusion
What can you conclude? Type out your conclusion below. 

Look back at your notebook. Think about how you might summarize what you have done, and prepare a quick presentation on it to your mentor at your next meeting. 

We hope you enjoyed this practical project. It should have consolidated your data hygiene and pandas skills by looking at a real-world problem involving just the kind of dataset you might encounter as a budding data scientist. Congratulations, and looking forward to seeing you at the next step in the course!